v1/app/Models/User/UserRoleModel.php

    public function existsId($userRoleId)
    {
        $builder = $this->db->table($this->table);
        $builder->select('id');
        $builder->where('id', $userRoleId);
        $builder->where('removed', 0);
        if ($this->debugMode === TRUE)
        {
            echo  $builder->getCompiledSelect();
        }
        $q =  $builder->get()->getResult();
---
SELECT `id`
FROM `user_roles`
WHERE `id` = 2
AND `removed` = 0