v1/app/Models/User/UserModel.php

UPDATE `users` SET `active` = 1, `verified` = 1
WHERE `id` = '13'
AND `email` = 'musil.marek.m@gmail.com'
---
    public function activate()
    {
        $builder = $this->db->table($this->table);

        $userData = [
            'active' => 1,
        ];

        $builder->where('id', $this->userId);
        $builder->update($userData);

UPDATE `users` SET `id` = '14', `password` = '$2y$10$2uoisI7V4siY7j2mrtBtGehow0ZbhfmHzYhGl7gGEI5QfkbvKPhCm', `update_time` = '2024-01-31 12:46:03'
WHERE `id` = '14'
---
            $userBranch = new UserBranchModel;
            $userBranch->setData($userBranches);
            $userBranch->setUserId($this->userId);
            $userBranch->updateRecord();

SELECT `id`
FROM `users`
WHERE `id` = '14'
AND `removed` = 0
---
    public function existsEmail($email, $userId = NULL) //userEmail
    {
        $builder = $this->db->table($this->table);
        $builder->select('id');
        $builder->where('email', $email);
        $builder->where('removed', 0);

        if (!is_null($userId))
        {
            $builder->where('id !=', $userId);
        }

        if ($this->debugMode === TRUE)
        {
            echo $builder->getCompiledSelect();
        }

        $q = $builder->get()->getResult();

SELECT `id`
FROM `users`
WHERE `id` = '14'
AND `removed` = 0
---
    public function existsId($userId)
    {
        $builder = $this->db->table($this->table);
        $builder->select('id');
        $builder->where('id', $userId);
        $builder->where('removed', 0);
        if ($this->debugMode === TRUE)
        {
            echo $builder->getCompiledSelect();
        }
        $q = $builder->get()->getResult();